Revit 2024 API
UIControlledApplication.SelectionChanged Event
 Subscribe to the SelectionChanged event to be notified after the selection was changed.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2023
Syntax
C#
public event EventHandler<SelectionChangedEventArgs> SelectionChanged
Visual Basic
Public Event SelectionChanged As EventHandler(Of SelectionChangedEventArgs)
Visual C++
public:
 event EventHandler<SelectionChangedEventArgs^>^ SelectionChanged {
	void add (EventHandler<SelectionChangedEventArgs^>^ value);
	void remove (EventHandler<SelectionChangedEventArgs^>^ value);
}
Remarks
This event is raised after the selection was changed in the current document. Handlers of this event are forbidden to make modifications to the current document. Handlers of this event are forbidden to change the selection to the current document. It is not allowed to open a new transaction in the active document when handling this event.
See Also
UIControlledApplication Class
Autodesk.Revit.UI Namespace